import { Distortion } from '../models/distortion';

export const MOCK_DISTORTIONS: Distortion[] = [
  {
    title: 'Дихотомічне мислення',
    details: `Погляд на речі «все або нічого», не оцінюючи спектрі можливостей між двома крайнощами.
Речі «хороші або погані», «успіх або провал». Як правило, негативні категорії підтримуються з більшою готовністю.`,
    example: "Приклад: У мене ніколи нічого не вийде. Я не можу нікому довіряти. Я повний невдаха.",
    category: "Екстремальне мислення"
  },
  {
    title: 'Нереальні очікування/надвисокі стандарти',
    details: `Використання завищених вимог/стандартів до себе і/або інших.
    Використання слів «треба», «варто», «повинен»`,
    example: 'Якщо це не найкраще, то воно не рахується Я повинен отримувати високі бали. Помилки неприйнети. Я повинен догодити всім.',
    category: 'Екстремальне мислення'
  },
  {
    title: 'Катастрофізація',
    details: `Прогнозування найгіршого, іноді навіть при сприятливомe початку.
Це може відбутися дуже швидко, так що здається, що клек відразу «перескочив» до найгіршого висновку.`,
    example: 'Приклад: Я зробив помилку: мій керівник розгнівається мені не продовжать контракту; я втрачу роботу я ется чу свій будинок; моя дружина мене покине; я буду бідним і самотнім.',
    category: 'Екстремальне мислення'
  },
  {
    title: 'Надмірне узагальнення',
    details: 'Погляд на одну негативну подію як на ознаку того, що все погано.',
    example: 'Приклад: Я провалив інтерв\'ю, я ніколи не знайду роботи. Ці стосунки невдалі, я ніколи не знайду супутника життя. Вона мене принизила, я не можу нікому довіряти',
    category: 'Вибіркова увага'
  },
  {
    title: 'Розумовий фільтр',
    details: `Виокремлення і зосередження на одній негативній деталі, не зважаючи на інші, кращі події.
Зосередження на одній невдалій події тоді, коли решта дня
була вдалою.
Забування досягнень і компліментів, зосередження на єди-
ному випадку критики.`,
    example: 'Приклад: За один з екзаменів я отримав низький бал - це жахливо - я насправді ні на що не зданий.',
    category: 'Вибіркова увага'
  },
  {
    title: 'Знецінення позитивного',
    details: 'Відкинення, применшення або ігнорування будь-яких позитивних подій.',
    example: 'Приклад: Він говорить це лише з ввічливості. Їй просто щось від мене потрібно. Це лише маленьке досягнення, інші все роблять краще.',
    category: 'Вибіркова увага'
  },
  {
    title: 'Перебільшення і мінімізація',
    details: 'Перебільшення важливості негативних подій і недооцінення важливості позитивних.',
    example: 'Приклад: Як же я зіпсував цю угоду. Так, я отримав умови, які хотів мій керівник, але я не зробив цього добре.',
    category: 'Вибіркова увага'
  },
  {
    title: 'Перехід до висновків',
    details: `Інтерпретація за відсутності фактів, що її підтримують.
Приклади переходу до висновків поділяють на дві категорії: читання думок та передбачення (пророкування щодо майбутнього)`,
    example: `Приклад: Я точно знаю, що вони насміхалися з мене, не зважаючи на їхні усміхнені обличчя. Коли він мене побачить, я йому не сподобаюсь.`,
    category: 'Покладання на інтуїцію'
  },
  {
    title: 'Емоційне мислення',
    details: `Думки про те, що емоції свідчать про факти.`,
    example: `Приклад: Я відчуваю, що не можу впоратись, тому я краще випʼю спершу кілька склянок. Я почуваюсь жахливо, коли злюся, тому це погано злитися. Я почуваюсь непривабливим, отже, я такий і є.`,
    category: 'Покладання на інтуїцію'
  },
  {
    title: 'Приймати речі на власний рахунок',
    details: `Брати на себе відповідальність, якщо щось (що сприймається як погане) стається.`,
    example: `Приклад: Вечірка не вдалася: це моя провина, бо я відчував напруження і це змушувало інших почуватись неком-фортно. Деоє студентів вийшло з моєї лекції раніше; напевно я нудний.`,
    category: 'Самозвинувачення'
  },
  {
    title: 'Самозвинувачення або самокритика',
    details: `Бачення себе як причини усього поганого або самокритика без причини.`,
    example: `Приклад: Я почуваюсь погано; я напевно сам на себе це інакликав; я не можу впоратись зі своєю роботою, отже, я дурний i лінивий`,
    category: 'Самозвинувачення'
  },
  {
    title: 'Осудження (Навішування ярликів)',
    details: `Називання себе жорстокими і принизливими словами.`,
    example: `Приклад: Ідіот! Я такий дурний. Що я за дурень.`,
    category: 'Самозвинувачення'
  }
];