export const STEB_TOOLTIPS = {
  STEB: `Ситуація/Думки/Емоції/Поведінка (СДЕП) — це техніка дослідження ситуації, винайдена засновником КПТ Аароном Беком. Вона випливає з базового принципу,
що у будь-якій ситуації є 4 компоненти і для повного розуміння себе, потрібно усвідомлювати кожну площину.`,
  situation: `Це будь-яке явище чи момент, у якому ми себе вловлюємо. Щось, що відбувається навколо нас у реальному чи уявному житті та є тригером подальшої реакції.`,
  thoughts: `Це наша когнітивна частина: усі слова, фрази, переконання та правила, які починають звучати в голові.`,
  emotions: `Це наша емоційна сфера: набір різних емоційних переживань, які зʼявляються після думок.`,
  behavior: `Це дії, які ми робимо, щоб справитись з ситуацією. Деякі з них корисні нам, деякі ні. Їх можна розділити на три основні стратегії: Fight/flight/freeze.`
};